Tekla Open API Reference for Tekla Structures 2025
IntList.Item Property
 Gets or sets the integer at the specified index.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Integer
	Get
	Set
Parameters
index
Type: System.Int32
The zero-based index of the element to get or set.
Property Value
Type: Int32
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace